data/collected_data/orange/api/standarda4v2/j/load_compose.txt
Running 30m test @ http://20.90.250.192:60/wrk2-api/post/compose
  2 threads and 1000 connections
  Thread calibration: mean lat.: 4009.394ms, rate sampling interval: 13352ms
  Thread calibration: mean lat.: 4083.288ms, rate sampling interval: 13017ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    12.50m     8.01m   27.51m    58.71%
    Req/Sec    42.16     10.20    62.00     77.04%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.07m 
 75.000%   19.45m 
 90.000%   24.24m 
 99.000%   27.51m 
 99.900%   28.98m 
 99.990%   29.45m 
 99.999%   29.62m 
100.000%   29.66m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4542.463     0.000000            1         1.00
  136183.807     0.100000        15278         1.11
  268173.311     0.200000        30557         1.25
  398458.879     0.300000        45833         1.43
  531628.031     0.400000        61113         1.67
  664272.895     0.500000        76402         2.00
  774373.375     0.550000        84033         2.22
  881328.127     0.600000        91670         2.50
  981467.135     0.650000        99329         2.86
 1080033.279     0.700000       106956         3.33
 1167065.087     0.750000       114640         4.00
 1209008.127     0.775000       118421         4.44
 1253048.319     0.800000       122261         5.00
 1300234.239     0.825000       126056         5.71
 1353711.615     0.850000       129897         6.67
 1405091.839     0.875000       133672         8.00
 1430257.663     0.887500       135600         8.89
 1454374.911     0.900000       137531        10.00
 1477443.583     0.912500       139450        11.43
 1501560.831     0.925000       141374        13.33
 1525678.079     0.937500       143276        16.00
 1537212.415     0.943750       144186        17.78
 1550843.903     0.950000       145157        20.00
 1565523.967     0.956250       146119        22.86
 1580204.031     0.962500       147057        26.67
 1595932.671     0.968750       148043        32.00
 1603272.703     0.971875       148507        35.56
 1610612.735     0.975000       148974        40.00
 1617952.767     0.978125       149427        45.71
 1626341.375     0.981250       149937        53.33
 1634729.983     0.984375       150431        64.00
 1638924.287     0.985938       150665        71.11
 1643118.591     0.987500       150876        80.00
 1648361.471     0.989062       151140        91.43
 1652555.775     0.990625       151348       106.67
 1657798.655     0.992188       151573       128.00
 1660944.383     0.992969       151702       142.22
 1664090.111     0.993750       151811       160.00
 1668284.415     0.994531       151948       182.86
 1672478.719     0.995313       152063       213.33
 1677721.599     0.996094       152172       256.00
 1680867.327     0.996484       152228       284.44
 1686110.207     0.996875       152286       320.00
 1693450.239     0.997266       152345       365.71
 1702887.423     0.997656       152407       426.67
 1713373.183     0.998047       152469       512.00
 1718616.063     0.998242       152500       568.89
 1722810.367     0.998437       152526       640.00
 1728053.247     0.998633       152555       731.43
 1734344.703     0.998828       152592       853.33
 1738539.007     0.999023       152614      1024.00
 1742733.311     0.999121       152632      1137.78
 1743781.887     0.999219       152644      1280.00
 1745879.039     0.999316       152659      1462.86
 1749024.767     0.999414       152678      1706.67
 1751121.919     0.999512       152688      2048.00
 1753219.071     0.999561       152696      2275.56
 1755316.223     0.999609       152705      2560.00
 1756364.799     0.999658       152710      2925.71
 1758461.951     0.999707       152719      3413.33
 1760559.103     0.999756       152726      4096.00
 1761607.679     0.999780       152729      4551.11
 1763704.831     0.999805       152739      5120.00
 1763704.831     0.999829       152739      5851.43
 1764753.407     0.999854       152742      6826.67
 1765801.983     0.999878       152745      8192.00
 1766850.559     0.999890       152747      9102.22
 1767899.135     0.999902       152748     10240.00
 1768947.711     0.999915       152749     11702.86
 1771044.863     0.999927       152751     13653.33
 1773142.015     0.999939       152753     16384.00
 1774190.591     0.999945       152756     18204.44
 1774190.591     0.999951       152756     20480.00
 1774190.591     0.999957       152756     23405.71
 1775239.167     0.999963       152758     27306.67
 1775239.167     0.999969       152758     32768.00
 1775239.167     0.999973       152758     36408.89
 1776287.743     0.999976       152759     40960.00
 1776287.743     0.999979       152759     46811.43
 1777336.319     0.999982       152760     54613.33
 1777336.319     0.999985       152760     65536.00
 1777336.319     0.999986       152760     72817.78
 1778384.895     0.999988       152761     81920.00
 1778384.895     0.999989       152761     93622.86
 1778384.895     0.999991       152761    109226.67
 1778384.895     0.999992       152761    131072.00
 1778384.895     0.999993       152761    145635.56
 1779433.471     0.999994       152762    163840.00
 1779433.471     1.000000       152762          inf
#[Mean    =   749774.846, StdDeviation   =   480586.734]
#[Max     =  1778384.896, Total count    =       152762]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  153707 requests in 30.00m, 28.84MB read
  Socket errors: connect 0, read 70641, write 796906, timeout 514161
  Non-2xx or 3xx responses: 756
Requests/sec:     85.39
Transfer/sec:     16.40KB